It works!

I've tested this with `kubernetes_manifest` resources following the scenario reported in issue #133 and can confirm this change resolves the reported issue.

```
➜  configmap git:(update-sdk) ✗ terraform apply -auto-approve
╷
│ Warning: Provider development overrides are in effect
│
│ The following provider development overrides are set in the CLI configuration:
│  - hashicorp/kubernetes in /Users/alex/work/terraform-provider-kubernetes
│
│ The behavior may therefore not match any released version of the provider and applying changes may cause the state to become incompatible with published releases.
╵

Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # kubernetes_manifest.test-configmap will be created
  + resource "kubernetes_manifest" "test-configmap" {
      + manifest = {
          + apiVersion = "v1"
          + data       = {
              + foo = "bar"
            }
          + kind       = "ConfigMap"
          + metadata   = {
              + labels    = {
                  + app         = "test-app"
                  + environment = "production"
                }
              + name      = "test-config"
              + namespace = "default"
            }
        }
      + object   = {
          + apiVersion = "v1"
          + binaryData = (known after apply)
          + data       = {
              + "foo" = "bar"
            }
          + immutable  = (known after apply)
          + kind       = "ConfigMap"
          + metadata   = {
              + annotations                = (known after apply)
              + clusterName                = (known after apply)
              + creationTimestamp          = (known after apply)
              + deletionGracePeriodSeconds = (known after apply)
              + deletionTimestamp          = (known after apply)
              + finalizers                 = (known after apply)
              + generateName               = (known after apply)
              + generation                 = (known after apply)
              + labels                     = (known after apply)
              + managedFields              = (known after apply)
              + name                       = "test-config"
              + namespace                  = "default"
              + ownerReferences            = (known after apply)
              + resourceVersion            = (known after apply)
              + selfLink                   = (known after apply)
              + uid                        = (known after apply)
            }
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.
kubernetes_manifest.test-configmap: Creating...
kubernetes_manifest.test-configmap: Creation complete after 0s

Apply complete! Resources: 1 added, 0 changed, 0 destroyed.
➜  configmap git:(update-sdk)
```